Repository: diyanqi/OpenZweb
Catalog: OpenZweb/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# common.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# common.ok
source: OK
zh_hans: 确定
zh_hant: 確定

# common.done
source: Done
zh_hans: 完成
zh_hant: 完成

# common.copy
source: Copy
zh_hans: 复制
zh_hant: 複製

# common.submit
source: Submit
zh_hans: 提交
zh_hant: 提交

# common.close
source: Close
zh_hans: 关闭
zh_hant: 關閉

# common.later
source: Later
zh_hans: 稍后
zh_hant: 稍後

# common.open
source: Open
zh_hans: 打开
zh_hant: 打開

# common.continue
source: Continue
zh_hans: 继续
zh_hant: 繼續

# common.language
source: Language
zh_hans: 语言
zh_hant: 語言

# common.system_default
source: Follow System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# common.zh_hans
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 簡體中文

# common.zh_hant
source: Traditional Chinese
zh_hans: 繁体中文
zh_hant: 繁體中文

# sidebar.protocol
source: Protocol
zh_hans: 协议
zh_hant: 協議

# sidebar.mode
source: Mode
zh_hans: 模式
zh_hant: 模式

# sidebar.server
source: Server
zh_hans: 服务器
zh_hant: 伺服器

# sidebar.channel
source: Channel
zh_hans: 通道
zh_hant: 通道

# sidebar.tun_iface
source: Virtual NIC
zh_hans: 虚拟网卡
zh_hant: 虛擬網卡

# sidebar.local_proxy
source: Local Proxy
zh_hans: 本地代理
zh_hant: 本機代理

# sidebar.lan
source: LAN
zh_hans: 局域网
zh_hant: 區域網路

# sidebar.logs
source: Logs
zh_hans: 运行日志
zh_hant: 執行日誌

# sidebar.routing
source: Routing Rules
zh_hans: 分流规则
zh_hant: 分流規則

# sidebar.settings
source: Settings
zh_hans: 设置
zh_hant: 設定

# sidebar.about
source: About
zh_hans: 关于
zh_hant: 關於

# mode.proxy
source: Proxy
zh_hans: 代理
zh_hant: 代理

# mode.proxy_short
source: Proxy
zh_hans: 代理
zh_hant: 代理

# mode.tun_global
source: TUN (Global)
zh_hans: TUN 全局
zh_hant: TUN 全域

# mode.proxy_socks_http
source: Proxy (SOCKS5 / HTTP)
zh_hans: 代理 (SOCKS5 / HTTP)
zh_hant: 代理 (SOCKS5 / HTTP)

# mode.tun_full
source: TUN virtual interface
zh_hans: TUN 虚拟网卡
zh_hant: TUN 虛擬網卡

# phase.idle
source: Disconnected
zh_hans: 未连接
zh_hant: 未連線

# phase.preparing
source: Preparing
zh_hans: 准备中
zh_hant: 準備中

# phase.authenticating
source: Authenticating
zh_hans: 正在认证
zh_hant: 正在認證

# phase.waiting_captcha
source: Captcha required
zh_hans: 等待验证码
zh_hant: 等待驗證碼

# phase.waiting_sms
source: SMS code required
zh_hans: 等待短信验证码
zh_hant: 等待簡訊驗證碼

# phase.connecting
source: Connecting
zh_hans: 正在建立隧道
zh_hant: 正在建立通道

# phase.connected
source: Connected
zh_hans: 已连接
zh_hant: 已連線

# phase.disconnecting
source: Disconnecting
zh_hans: 正在断开
zh_hant: 正在中斷

# phase.failed
source: Failed
zh_hans: 连接失败
zh_hant: 連線失敗

# auth.password
source: Password
zh_hans: 密码认证
zh_hant: 密碼認證

# auth.cas
source: CAS (Unified Auth)
zh_hans: 统一身份认证 (CAS)
zh_hant: 統一身分認證 (CAS)

# auth.sms
source: SMS code
zh_hans: 短信验证码
zh_hant: 簡訊驗證碼

# conn.proxy_desc
source: Proxy (SOCKS5/HTTP)
zh_hans: 代理模式 (SOCKS5/HTTP)
zh_hant: 代理模式 (SOCKS5/HTTP)

# conn.tun_desc
source: TUN (system-wide)
zh_hans: TUN 全局虚拟网卡
zh_hant: TUN 全域虛擬網卡

# login.title
source: Zhejiang University Intranet
zh_hans: 浙江大学校内网
zh_hant: 浙江大學校內網

# login.subtitle
source: Sangfor aTrust · Elegant campus VPN
zh_hans: 深信服 aTrust · 优雅接入校园 VPN
zh_hant: 深信服 aTrust · 優雅接入校園 VPN

# login.username
source: Student ID / Username
zh_hans: 学号 / 用户名
zh_hant: 學號 / 使用者名稱

# login.username_ph
source: e.g. 322010XXXX
zh_hans: 例如 322010XXXX
zh_hant: 例如 322010XXXX

# login.password
source: Password
zh_hans: 密码
zh_hant: 密碼

# login.password_ph
source: Unified auth / campus password
zh_hans: 统一身份认证 / 校园网密码
zh_hant: 統一身分認證 / 校園網密碼

# login.auth_method
source: Auth method
zh_hans: 认证方式
zh_hant: 認證方式

# login.conn_mode
source: Connection mode
zh_hans: 连接模式
zh_hant: 連線模式

# login.tun_hint
source: TUN requires an admin password for system-wide access
zh_hans: TUN 需要管理员密码，可实现系统级内网访问
zh_hant: TUN 需要管理員密碼，可實現系統級內網存取

# login.remember
source: Remember password (Keychain)
zh_hans: 记住密码（钥匙串）
zh_hant: 記住密碼（鑰匙圈）

# login.manage_proxy
source: Set system proxy after connect
zh_hans: 连接后自动设置系统代理
zh_hant: 連線後自動設定系統代理

# login.manage_proxy_hint
source: Coexist with Clash: do not change system proxy; route campus domains to local SOCKS.
zh_hans: 与 Clash 共存：不改系统代理；把校内域名规则指到本机 SOCKS。
zh_hant: 與 Clash 共存：不改系統代理；把校內網域規則指到本機 SOCKS。

# login.share_lan
source: Share proxy on LAN after connect
zh_hans: 连接后向局域网共享代理
zh_hant: 連線後向區域網路共用代理

# login.share_lan_hint
source: Listen on 0.0.0.0 so other devices can use this Mac’s proxy by IP and port.
zh_hans: 将监听 0.0.0.0，其他设备可填写本机 IP 与端口使用代理。
zh_hant: 將監聽 0.0.0.0，其他裝置可填寫本機 IP 與連接埠使用代理。

source: Login domain
zh_hans: 登录域
zh_hant: 登入網域

# login.connect
source: Connect
zh_hans: 连接内网
zh_hant: 連線內網

# login.cancel_connect
source: Cancel
zh_hans: 取消
zh_hant: 取消

# login.core_missing
source: Protocol engine not installed
zh_hans: 未安装协议引擎
zh_hant: 未安裝協定引擎

# login.download_core
source: Download engine
zh_hans: 下载引擎
zh_hant: 下載引擎

# connected.title
source: Connected to ZJU intranet
zh_hans: 已接入浙江大学内网
zh_hant: 已接入浙江大學內網

# connected.uptime
source: %@ · Connected %@
zh_hans: %@ · 已连接 %@
zh_hant: %@ · 已連線 %@

# connected.throughput
source: Live throughput
zh_hans: 实时吞吐
zh_hant: 即時吞吐

# connected.check_ip
source: Check public IP
zh_hans: 检测公网 IP
zh_hant: 檢測公網 IP

# connected.download
source: Download
zh_hans: 下载
zh_hant: 下載

# connected.upload
source: Upload
zh_hans: 上传
zh_hant: 上傳

# connected.public_ip
source: Public IP
zh_hans: 公网 IP
zh_hant: 公網 IP

# connected.geo
source: Location
zh_hans: 归属地
zh_hant: 歸屬地

# connected.geo_disclaimer
source: Public IP and location come from third-party APIs for reference only; they may not reflect your real physical location.
zh_hans: 公网 IP 与归属地来自第三方 API，仅供参考，不代表真实物理位置。
zh_hant: 公網 IP 與歸屬地來自第三方 API，僅供參考，不代表真實實體位置。

# connected.info
source: Connection info
zh_hans: 接入信息
zh_hant: 接入資訊

# connected.mode_tun_hint
source: System-wide virtual NIC. To use proxy mode, disconnect and switch on the login page.
zh_hans: 系统级虚拟网卡；如需改为代理模式，请断开后在登录页切换再连接。
zh_hant: 系統級虛擬網卡；如需改為代理模式，請中斷後在登入頁切換再連線。

# connected.mode_proxy_hint
source: Apps use local SOCKS/HTTP proxy. To use TUN, disconnect and switch on the login page.
zh_hans: 应用通过本机 SOCKS/HTTP 代理访问内网；如需 TUN，请断开后在登录页切换。
zh_hant: 應用透過本機 SOCKS/HTTP 代理存取內網；如需 TUN，請中斷後在登入頁切換。

# connected.nav_title
source: ZJU Navigation
zh_hans: 浙大导航
zh_hant: 浙大導航

# connected.nav_sub
source: Campus site directory · zjuers.com
zh_hans: 常用校内站点入口 · zjuers.com
zh_hant: 常用校內網站入口 · zjuers.com

# connected.nav_go
source: Open navigation
zh_hans: 前往导航页
zh_hant: 前往導航頁

# connected.export_pac
source: Export PAC
zh_hans: 导出 PAC
zh_hant: 匯出 PAC

# connected.disconnect
source: Disconnect
zh_hans: 断开连接
zh_hant: 中斷連線

# connected.lan_share
source: LAN sharing
zh_hans: 局域网共享
zh_hant: 區域網路共用

# connected.lan_ip
source: This Mac LAN IP
zh_hans: 本机局域网 IP
zh_hant: 本機區域網路 IP

# connected.lan_none
source: No LAN address detected
zh_hans: 未检测到局域网地址
zh_hant: 未偵測到區域網路位址

# connected.lan_hint
source: On other devices on the same network, set the system/app proxy to the address and port above. QR codes cannot configure the system automatically, so only connection info is shown.
zh_hans: 其他设备请在同一网络下，将系统/App 代理指向上述地址与端口。二维码仅为纯文本，无法自动改系统设置，故仅展示连接信息。
zh_hant: 其他裝置請在同一網路下，將系統/App 代理指向上述位址與連接埠。QR 碼僅為純文字，無法自動改系統設定，故僅展示連線資訊。

# connected.lan_show
source: Show connection info
zh_hans: 显示连接信息
zh_hant: 顯示連線資訊

# connected.lan_sheet_title
source: LAN proxy info
zh_hans: 局域网代理连接信息
zh_hant: 區域網路代理連線資訊

# connected.lan_sheet_hint
source: Enter the following proxy on other devices. Stay on the same Wi‑Fi and allow macOS firewall access.
zh_hans: 请在其他设备上手动填写下列代理。需与本机同一 Wi‑Fi，并允许 macOS 防火墙通过。
zh_hant: 請在其他裝置上手動填寫下列代理。需與本機同一 Wi‑Fi，並允許 macOS 防火牆通過。

# connected.copy_all
source: Copy all
zh_hans: 复制全部
zh_hant: 複製全部

# connected.pac_exported
source: PAC exported
zh_hans: 已导出 PAC
zh_hant: 已匯出 PAC

# captcha.title
source: Human verification
zh_hans: 人机验证
zh_hant: 人機驗證

# captcha.hint
source: Click the captcha characters below. Login continues automatically when done.
zh_hans: 在下方点选验证码字符。完成后会自动继续登录。
zh_hant: 在下方點選驗證碼字元。完成後會自動繼續登入。

# sms.title
source: SMS verification code
zh_hans: 短信验证码
zh_hant: 簡訊驗證碼

# sms.hint
source: Enter the 6-digit code sent to your bound phone
zh_hans: 请输入发送到绑定手机的 6 位验证码
zh_hant: 請輸入傳送到綁定手機的 6 位驗證碼

# sms.verifying
source: Verifying code…
zh_hans: 正在校验验证码…
zh_hant: 正在校验驗證碼…

# sms.skip_secondary
source: Skip future SMS verification
zh_hans: 跳过以后的短信验证
zh_hant: 略過以後的簡訊驗證

# sms.skip_help
source: Same as EZ4Connect: prefix $ to request skipping later secondary SMS. Server policy may deny it.
zh_hans: 与 EZ4Connect 相同：验证码前加 $，请求跳过后续二次短信。服务端不一定允许。
zh_hant: 與 EZ4Connect 相同：驗證碼前加 $，請求略過後續二次簡訊。伺服器不一定允許。

# sms.reenter
source: The field will shake on error; re-enter the 6-digit code and submit
zh_hans: 输入框会抖动提示错误，请重新输入 6 位验证码后提交
zh_hant: 輸入框會抖動提示錯誤，請重新輸入 6 位驗證碼後提交

# proxy.conflict_title
source: Close system proxy first
zh_hans: 请先关闭系统代理
zh_hant: 請先關閉系統代理

# proxy.conflict_detail
source: A system proxy is enabled (HTTP / HTTPS / SOCKS or auto-proxy). Turn all proxy switches off in System Settings → Network → Details → Proxies, then connect again. (If this is a leftover OpenZweb local proxy, tap “Connect Anyway”; OpenZweb will take over again after a successful connect.)
zh_hans: 检测到系统代理已开启（HTTP / HTTPS / SOCKS 或自动代理）。请到「系统设置 → 网络 → 详细信息 → 代理」关闭全部开关后再连接。 （若是 OpenZweb 上次连接留下的本机代理，可点「仍然连接」；连接成功后会重新接管。）
zh_hant: 偵測到系統代理已開啟（HTTP / HTTPS / SOCKS 或自動代理）。請到「系統設定 → 網路 → 詳細資訊 → 代理」關閉全部開關後再連線。 （若是 OpenZweb 上次連線留下的本機代理，可點「仍然連線」；連線成功後會重新接管。）

# proxy.recheck
source: Recheck
zh_hans: 重新检测
zh_hant: 重新檢測

# proxy.connect_anyway
source: Connect Anyway
zh_hans: 仍然连接
zh_hant: 仍然連線

# proxy.check_pass_empty
source: Passed: system proxy is empty
zh_hans: 通过：当前系统代理为空
zh_hant: 通過：目前系統代理為空

# proxy.check_pass_self
source: Passed: only OpenZweb residual local proxy detected (safe to continue)
zh_hans: 通过：仅检测到 OpenZweb 自身残留系统代理（可安全继续）
zh_hant: 通過：僅偵測到 OpenZweb 自身殘留系統代理（可安全繼續）

# proxy.check_fail
source: Failed: %@
zh_hans: 未通过：%@
zh_hant: 未通過：%@

# settings.server
source: Server
zh_hans: 服务器
zh_hant: 伺服器

# settings.address
source: Address
zh_hans: 地址
zh_hant: 位址

# settings.port
source: Port
zh_hans: 端口
zh_hant: 連接埠

# settings.protocol
source: Protocol
zh_hans: 协议
zh_hant: 協議

# settings.auth
source: Authentication
zh_hans: 认证
zh_hant: 認證

# settings.login_domain
source: Login domain
zh_hans: 登录域
zh_hant: 登入網域

# settings.connection
source: Connection
zh_hans: 连接
zh_hant: 連線

# settings.mode
source: Mode
zh_hans: 模式
zh_hant: 模式

# settings.share_lan
source: Share proxy on LAN (0.0.0.0)
zh_hans: 向局域网共享代理 (0.0.0.0)
zh_hant: 向區域網路共用代理 (0.0.0.0)

# settings.manage_proxy
source: Set system proxy after connect
zh_hans: 连接后自动设置系统代理
zh_hant: 連線後自動設定系統代理

# settings.manage_proxy_on
source: Will own system HTTP/SOCKS proxy. If Clash etc. is on, disable its system proxy first, or turn this off to coexist.
zh_hans: 会占用系统 HTTP/SOCKS 代理。若已开 Clash 等，请先关闭其系统代理，或关闭本选项以共存。
zh_hant: 會佔用系統 HTTP/SOCKS 代理。若已開 Clash 等，請先關閉其系統代理，或關閉本選項以共存。

# settings.manage_proxy_off
source: Does not change system proxy; can coexist with Clash. Point campus domains to local SOCKS (default 127.0.0.1:1080) and set vpn.zju.edu.cn to DIRECT.
zh_hans: 不修改系统代理，可与 Clash 等共存。请在 Clash 将 *.zju.edu.cn / cc98.org 等校内域名指向本机 SOCKS（默认 127.0.0.1:1080），并为 vpn.zju.edu.cn 设置直连。
zh_hant: 不修改系統代理，可與 Clash 等共存。請在 Clash 將 *.zju.edu.cn / cc98.org 等校內網域指向本機 SOCKS（預設 127.0.0.1:1080），並為 vpn.zju.edu.cn 設定直連。

# settings.auto_reconnect
source: Auto reconnect on drop
zh_hans: 断线自动重连
zh_hant: 斷線自動重連

# settings.prefer_skip_sms
source: Prefer “Skip future SMS verification”
zh_hans: 默认勾选「跳过以后的短信验证」
zh_hant: 預設勾選「略過以後的簡訊驗證」

# settings.prefer_skip_sms_hint
source: Defaults to checked on secondary SMS (submit with $ prefix, like EZ4Connect). Effectiveness depends on aTrust policy.
zh_hans: 二次短信时默认勾选跳过（提交加 $ 前缀，同 EZ4Connect）。是否生效取决于 aTrust 策略。
zh_hant: 二次簡訊時預設勾選略過（提交加 $ 前綴，同 EZ4Connect）。是否生效取決於 aTrust 策略。

# settings.advanced
source: Advanced
zh_hans: 高级
zh_hant: 進階

# settings.skip_domain
source: Skip domain resources
zh_hans: 跳过域名资源
zh_hant: 略過網域資源

# settings.debug
source: Debug logging
zh_hans: 调试日志
zh_hant: 除錯日誌

# settings.ui
source: Interface
zh_hans: 界面
zh_hant: 介面

# settings.show_monitor
source: Show network monitor panel
zh_hans: 显示网络监测面板
zh_hant: 顯示網路監測面板

# settings.compact
source: Compact layout
zh_hans: 紧凑布局
zh_hant: 緊湊佈局

# settings.launch_login
source: Launch at login
zh_hans: 登录时启动
zh_hant: 登入時啟動

# settings.check_updates_launch
source: Check for updates on launch
zh_hans: 启动时检查更新
zh_hant: 啟動時檢查更新

# settings.updates
source: Updates
zh_hans: 更新
zh_hant: 更新

# settings.engine
source: Protocol engine
zh_hans: 协议引擎
zh_hant: 協定引擎

# settings.path
source: Path
zh_hans: 路径
zh_hant: 路徑

# settings.not_installed
source: Not installed
zh_hans: 未安装
zh_hant: 未安裝

# settings.language_hint
source: Default follows macOS. Change applies immediately to most UI text.
zh_hans: 默认跟随系统。切换后大部分界面文案会立即更新。
zh_hant: 預設跟隨系統。切換後大部分介面文案會立即更新。

# routing.title
source: Routing Rules
zh_hans: 分流规则
zh_hant: 分流規則

# routing.subtitle
source: Allowlist is written to the engine; denylist goes to system proxy bypass
zh_hans: 白名单写入引擎；黑名单写入系统代理绕过列表
zh_hant: 白名單寫入引擎；黑名單寫入系統代理繞過清單

# routing.allow_header
source: Allowlist (force VPN)
zh_hans: 白名单（强制代理）
zh_hant: 白名單（強制代理）

# routing.allow_hint
source: Allow list: only these domains use OpenZweb (PAC). Leave empty to send all traffic through the system proxy. One domain per line; *.example.com is OK.
zh_hans: 白名单：仅这些域名走 OpenZweb（PAC 分流）。留空则全部流量走系统代理。每行一个域名；支持 *.example.com。
zh_hant: 白名單：僅這些網域走 OpenZweb（PAC 分流）。留空則全部流量走系統代理。每行一個網域；支援 *.example.com。

# routing.allow_example
source: e.g. *.zju.edu.cn www.cc98.org scholar.edu.cn github.com
zh_hans: 例如： *.zju.edu.cn www.cc98.org scholar.edu.cn github.com
zh_hant: 例如： *.zju.edu.cn www.cc98.org scholar.edu.cn github.com

# routing.deny_header
source: Denylist (bypass)
zh_hans: 黑名单（直连绕过）
zh_hant: 黑名單（直連繞過）

# routing.deny_hint
source: Deny list: always DIRECT (system proxy bypass / PAC). Useful for local LAN and tools that must not use the VPN proxy.
zh_hans: 黑名单：始终直连（系统代理绕过 / PAC）。适合本机、局域网或不想走 VPN 的工具。
zh_hant: 黑名單：始終直連（系統代理繞過 / PAC）。適合本機、區域網或不想走 VPN 的工具。

# routing.deny_example
source: Example: localhost, music.163.com — only applies when “Set system proxy” is on
zh_hans: 示例：localhost, music.163.com — 仅在开启「自动设置系统代理」时生效
zh_hant: 範例：localhost, music.163.com — 僅在開啟「自動設定系統代理」時生效

# routing.note
source: Tip: with an allow list, only listed hosts hit OpenZweb — ideal for coexisting with other proxies. Empty allow list = global proxy.
zh_hans: 提示：填写白名单后，只有名单内域名进入 OpenZweb，便于与其他代理共存。白名单为空 = 全局系统代理。
zh_hant: 提示：填寫白名單後，只有名單內網域進入 OpenZweb，便於與其他代理共存。白名單為空 = 全域系統代理。

# about.tagline
source: ZJU · Native aTrust client
zh_hans: 浙江大学 · aTrust 原生客户端
zh_hant: 浙江大學 · aTrust 原生客戶端

# about.version
source: Version
zh_hans: 版本
zh_hant: 版本

# about.engine
source: Engine
zh_hans: 协议引擎
zh_hant: 協定引擎

# about.compat
source: Compatible with
zh_hans: 兼容
zh_hant: 相容

# about.compat_value
source: Sangfor aTrust / EZ4Connect
zh_hans: 深信服 aTrust / EZ4Connect
zh_hant: 深信服 aTrust / EZ4Connect

# about.project
source: This project
zh_hans: 本项目
zh_hant: 本專案

# about.thanks
source: Acknowledgments
zh_hans: 鸣谢
zh_hant: 鳴謝

# about.project_sub
source: Native Swift macOS client
zh_hans: Swift 原生 macOS 客户端
zh_hant: Swift 原生 macOS 客戶端

# menu.connect
source: Connection
zh_hans: 连接
zh_hant: 連線

# menu.disconnect
source: Disconnect
zh_hans: 断开连接
zh_hant: 中斷連線

# menu.copy_socks
source: Copy SOCKS5 address
zh_hans: 复制 SOCKS5 地址
zh_hant: 複製 SOCKS5 位址

# menu.copy_http
source: Copy HTTP proxy address
zh_hans: 复制 HTTP 代理地址
zh_hant: 複製 HTTP 代理位址

# menu.copy_lan
source: Copy LAN proxy info
zh_hans: 复制局域网代理信息
zh_hant: 複製區域網路代理資訊

# menu.show_main
source: Show Main Window
zh_hans: 显示主窗口
zh_hant: 顯示主視窗

# menu.check_update
source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

# menu.copy_socks_short
source: Copy SOCKS5
zh_hans: 复制 SOCKS5
zh_hant: 複製 SOCKS5

# menu.copy_http_short
source: Copy HTTP
zh_hans: 复制 HTTP
zh_hant: 複製 HTTP

# menu.quit
source: Quit OpenZweb
zh_hans: 退出 OpenZweb
zh_hant: 結束 OpenZweb

# menu.manage_proxy
source: Auto-manage system proxy
zh_hans: 系统代理自动管理
zh_hant: 系統代理自動管理

# menu.share_lan
source: Share proxy on LAN
zh_hans: 局域网共享代理
zh_hant: 區域網路共用代理

# menu.open_nav
source: Open ZJU navigation (zjuers.com)
zh_hans: 打开浙大导航 zjuers.com
zh_hant: 打開浙大導航 zjuers.com

# update.found
source: Update available
zh_hans: 发现新版本
zh_hant: 發現新版本

# update.view
source: View release
zh_hans: 查看发布页
zh_hant: 查看發佈頁

# update.check
source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

# update.checking
source: Checking…
zh_hans: 检查中…
zh_hant: 檢查中…

# update.latest
source: You are up to date
zh_hans: 已是最新版本
zh_hant: 已是最新版本

# update.available
source: New version: %@
zh_hans: 新版本：%@
zh_hant: 新版本：%@

# logs.title
source: Logs
zh_hans: 运行日志
zh_hant: 執行日誌

# logs.clear
source: Clear
zh_hans: 清空
zh_hant: 清空

# logs.copy
source: Copy all
zh_hans: 复制全部
zh_hant: 複製全部

# net.not_checked
source: Not checked yet
zh_hans: 尚未检测
zh_hant: 尚未檢測

# net.public_campus_ok
source: Public %@ · Campus reachable
zh_hans: 公网 %@ · 校内可达
zh_hant: 公網 %@ · 校內可達

# net.public_campus_fail
source: Public %@ · Campus probe failed
zh_hans: 公网 %@ · 校内探测失败
zh_hant: 公網 %@ · 校內探測失敗

# net.campus_ok
source: Campus reachable
zh_hans: 校内可达
zh_hant: 校內可達

# net.fail
source: Network probe failed
zh_hans: 网络探测失败
zh_hant: 網路探測失敗

# log.recheck
source: Recheck: %@
zh_hans: 重新检测：%@
zh_hant: 重新檢測：%@

# log.skip_once
source: Pre-check: skipped once by user choice
zh_hans: 连接前检查：已按用户选择跳过一次系统代理检测
zh_hant: 連線前檢查：已依使用者選擇略過一次系統代理檢測

# log.precheck
source: Pre-check: %@
zh_hans: 连接前检查：%@
zh_hant: 連線前檢查：%@

# log.self_residual
source: Pre-check: system proxy points to OpenZweb ports (residual); continuing
zh_hans: 连接前检查：当前系统代理指向本机 OpenZweb 端口，视为自身残留，继续连接
zh_hant: 連線前檢查：目前系統代理指向本機 OpenZweb 連接埠，視為自身殘留，繼續連線

# log.skip_manage_off
source: Pre-check: skipped (system proxy management off; may coexist with other proxies)
zh_hans: 连接前检查：已跳过（未开启「连接后自动设置系统代理」，可与其他代理共存）
zh_hant: 連線前檢查：已略過（未開啟「連線後自動設定系統代理」，可與其他代理共存）

# log.continue_anyway
source: Chose Connect Anyway (skip proxy check this time)
zh_hans: 已选择仍然连接（跳过本次系统代理检测）
zh_hant: 已選擇仍然連線（略過本次系統代理檢測）

# log.start_engine
source: Starting aTrust engine…
zh_hans: 启动 aTrust 协议引擎…
zh_hant: 啟動 aTrust 協定引擎…

# log.disconnecting
source: Disconnecting…
zh_hans: 正在断开连接…
zh_hant: 正在中斷連線…

# log.tunnel_up
source: Tunnel established (%@)
zh_hans: 隧道已建立 (%@)
zh_hant: 通道已建立 (%@)

# log.auth_fail
source: Authentication failed: %@
zh_hans: 认证失败: %@
zh_hant: 認證失敗: %@

# log.sms_fail
source: SMS code error: %@
zh_hans: 短信验证码错误: %@
zh_hant: 簡訊驗證碼錯誤: %@

# log.captcha_open
source: Captcha opened in-app; please complete the challenge
zh_hans: 人机验证页面已在应用内打开，请点选验证码
zh_hant: 人機驗證頁面已在應用內開啟，請點選驗證碼

# log.captcha_ok
source: Captcha received; continuing auth…
zh_hans: 已收到验证码，继续认证…
zh_hant: 已收到驗證碼，繼續認證…

# log.sms_sent
source: SMS code submitted
zh_hans: 已提交短信验证码
zh_hant: 已提交簡訊驗證碼

# log.sms_sent_skip
source: SMS code submitted ($ prefix: skip future SMS)
zh_hans: 已提交短信验证码（$ 前缀：请求跳过以后的短信验证）
zh_hant: 已提交簡訊驗證碼（$ 前綴：請求略過以後的簡訊驗證）

# log.proxy_set
source: System proxy set → HTTP %@ · SOCKS %@
zh_hans: 已设置系统代理 → HTTP %@ · SOCKS %@
zh_hant: 已設定系統代理 → HTTP %@ · SOCKS %@

# log.proxy_restore
source: Restored previous system proxy/DNS
zh_hans: 已恢复连接前的系统代理/DNS
zh_hant: 已恢復連線前的系統代理/DNS

# log.proxy_restoring
source: Restoring system proxy/DNS in background…
zh_hans: 正在后台恢复系统代理/DNS…
zh_hant: 正在背景恢復系統代理/DNS…

# log.proxy_applying
source: Configuring system proxy/DNS in background…
zh_hans: 正在后台配置系统代理/DNS（不阻塞界面）…
zh_hant: 正在背景設定系統代理/DNS（不阻塞介面）…

# conn.proxy_detail
source: No admin password required; configure app proxy to reach the intranet.
zh_hans: 无需管理员权限，应用自行配置代理即可访问内网。
zh_hant: 無需管理員權限，應用自行設定代理即可存取內網。

# conn.tun_detail
source: System-wide routing for all apps. Requires an admin password.
zh_hans: 系统级路由，全应用可直连内网。需要输入管理员密码。
zh_hant: 系統級路由，全應用可直連內網。需要輸入管理員密碼。

# login.core_missing_title
source: aTrust engine not installed
zh_hans: 尚未安装 aTrust 协议引擎
zh_hant: 尚未安裝 aTrust 協定引擎

# login.core_desc
source: OpenZweb uses open-source zju-connect for aTrust / EasyConnect.
zh_hans: OpenZweb 使用开源 zju-connect 实现 aTrust / EasyConnect。
zh_hant: OpenZweb 使用開源 zju-connect 實作 aTrust / EasyConnect。

# login.download_engine
source: Download engine
zh_hans: 下载协议引擎
zh_hant: 下載協定引擎

# captcha.refresh
source: Refresh
zh_hans: 刷新
zh_hant: 重新整理

# about.disclaimer_short
source: For campus learning and research network access only. Follow university and service terms.
zh_hans: 仅供校内学习科研网络访问。请遵守学校与相关服务条款。
zh_hant: 僅供校內學習科研網路存取。請遵守學校與相關服務條款。

# settings.current_version
source: Current version
zh_hans: 当前版本
zh_hant: 目前版本

# settings.latest_version
source: Latest version
zh_hans: 最新版本
zh_hant: 最新版本

# settings.zju_preset
source: ZJU defaults
zh_hans: 浙江大学预设
zh_hant: 浙江大學預設

# settings.restore_zju
source: Restore ZJU defaults
zh_hans: 恢复 ZJU 默认
zh_hant: 還原 ZJU 預設

# settings.open_release
source: Open release page
zh_hans: 打开发布页
zh_hant: 打開發佈頁

# cas.open_browser
source: Open in browser
zh_hans: 在浏览器中打开
zh_hant: 在瀏覽器中開啟

# cas.note
source: Note: this only opens the web page; a successful login here does not auto-connect VPN.
zh_hans: 说明：此处仅打开网页，登录成功后不会自动连 VPN。
zh_hant: 說明：此處僅開啟網頁，登入成功後不會自動連 VPN。

# cas.howto
source: To connect with unified auth: on the main screen choose “CAS (Unified Auth)”, then Connect; the engine handles the CAS flow.
zh_hans: 要用统一身份认证连内网：在主界面认证方式选「统一身份认证 (CAS)」，再点「连接内网」，由协议引擎完成 CAS 流程。
zh_hant: 要用統一身分認證連內網：在主介面認證方式選「統一身分認證 (CAS)」，再點「連線內網」，由協定引擎完成 CAS 流程。

# sms.skip_secondary_hint
source: You still enter the code this time. With this checked, a "$" prefix asks the server to skip secondary SMS next time (EZ4Connect). Server may refuse.
zh_hans: 本次仍须输入验证码。勾选后提交时会加 $ 前缀，请求服务器下次跳过二次短信（与 EZ4Connect 相同）。服务端可能拒绝。
zh_hant: 本次仍須輸入驗證碼。勾選後提交時會加 $ 前綴，請求伺服器下次略過二次簡訊（與 EZ4Connect 相同）。伺服器可能拒絕。

# settings.show_dock
source: Show in Dock when window is open
zh_hans: 窗口打开时显示在程序坞
zh_hant: 視窗開啟時顯示在程式塢

# settings.show_dock_hint
source: Closing the main window hides the Dock icon and keeps OpenZweb running in the menu bar. Quit only from the tray menu.
zh_hans: 关闭主窗口后程序坞图标会隐藏，应用继续在菜单栏托盘运行。请从托盘菜单选择退出。
zh_hant: 關閉主視窗後程式塢圖示會隱藏，應用繼續在選單列托盤執行。請從托盤選單選擇結束。

# lang.system
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# lang.zh_hant
source: 繁體中文
zh_hans: 繁体中文

# settings.language
source: Language
zh_hans: 界面语言
zh_hant: 介面語言

# routing.apply_now
source: Apply rules now
zh_hans: 立即应用规则
zh_hant: 立即套用規則

# routing.apply_now_hint
source: While connected, applies immediately via PAC / system proxy — no disconnect or re-login.
zh_hans: 已连接时可立即生效（更新 PAC / 系统代理），无需断开或重新登录。
zh_hant: 已連線時可立即生效（更新 PAC / 系統代理），無需中斷或重新登入。

# routing.applied
source: Routing rules applied
zh_hans: 分流规则已应用
zh_hant: 分流規則已套用

# egg.title
source: You found it
zh_hans: 你发现了彩蛋
zh_hant: 你發現了彩蛋

# egg.unmute
source: Sound
zh_hans: 声音
zh_hant: 聲音

# egg.close
source: Close
zh_hans: 关闭
zh_hant: 關閉

# lang.zh_hans
source: 简体中文
zh_hant: 簡體中文
